export const modules = [
  { id: 1, name: 'Геометрическое моделирование 2D' },
  { id: 2, name: 'Построение объектов в КОМПАС-3D' },
  { id: 3, name: 'Оригинальные средства в КОМПАС-3D' },
  { id: 4, name: 'Специальные средства в КОМПАС-3D' },
  { id: 5, name: 'Библиотеки в КОМПАС-3D' },
  { id: 6, name: 'Моделирование пространственных кривых' },
  { id: 7, name: 'Пространственные кривые в КОМПАС-3D' },
  { id: 8, name: 'Моделирование поверхностей' },
  { id: 9, name: 'Поверхности в КОМПАС 3D' },
  { id: 10, name: 'Моделирование тел' },
  { id: 11, name: 'Операции Выдавливание и Вращение' },
  { id: 12, name: 'Добавление и вычитание материала' },
  { id: 13, name: 'Конструктивные элементы модели' },
  { id: 14, name: 'Массивы и оболочка' },
  { id: 15, name: 'Размеры и обозначения' },
  { id: 16, name: 'Генерация чертежей из модели' },
];

export const tests = [
  {
    moduleId: 1,
    firstTest: 'Основы моделирования',
    secondTest: 'Геометрические преобразования',
  },
  {
    moduleId: 2,
    firstTest: 'Построение объектов',
    secondTest: 'Редактирование объектов',
  },
  {
    moduleId: 3,
    firstTest: 'Привязки и геометрический калькулятор',
    secondTest: 'Группы и макроэлементы',
  },
  {
    moduleId: 4,
    firstTest: 'Фрагменты',
    secondTest: 'Слои',
  },
  {
    moduleId: 5,
    firstTest: 'Использование библиотек',
    secondTest: 'Создание библиотеки фрагментов',
  },
  {
    moduleId: 6,
    firstTest: 'Сплайны',
    secondTest: 'Параметрические кривые',
  },
  {
    moduleId: 7,
    firstTest: 'Построение кривых',
    secondTest: 'Кривая по закону',
  },
  {
    moduleId: 8,
    firstTest: 'Описание поверхностей',
    secondTest: 'Построение поверхностей',
  },
  {
    moduleId: 9,
    firstTest: 'Построение поверхностей',
    secondTest: 'Операции над поверхностями',
  },
  {
    moduleId: 10,
    firstTest: 'Построение тел',
    secondTest: 'Описание тел',
  },
  {
    moduleId: 11,
    firstTest: 'Операция Выдавливания',
    secondTest: 'Операция Вращения',
  },
  {
    moduleId: 12,
    firstTest: 'Операция Кинематическая и По сечениям',
    secondTest: 'Добавление и вычитание материала',
  },
  {
    moduleId: 13,
    firstTest: 'Фаска и скругление',
    secondTest: 'Отверстия и Сечения',
  },
  {
    moduleId: 14,
    firstTest: 'Массивы',
    secondTest: 'Оболочка',
  },
  {
    moduleId: 15,
    firstTest: 'Простановка размеров',
    secondTest: 'Простановка обозначений',
  },
  {
    moduleId: 16,
    firstTest: 'Чертеж из модели',
    secondTest: 'Виды чертежа',
  },
];
